In [1]:
import pandas as pd

data = pd.Series([23.4, 54.3, 34.5, 9.0, 22.3])
data.mean()
data.sum()
type(data)

pandas.core.series.Series

In [33]:
data

Mon    23.4
Tue    54.3
Wed    34.5
Thu     9.0
Fri    22.3
dtype: float64

In [34]:
data.idxmin()

'Thu'

In [3]:
mixed = pd.Series([23.4, 54.3, 34.5, 9.0, 22.3, 'a', 'b', 'c'])
mixed

0    23.4
1    54.3
2    34.5
3     9.0
4    22.3
5       a
6       b
7       c
dtype: object

In [4]:
meta = data.describe()
meta
#meta['50%']

count     5.000000
mean     28.700000
std      16.927345
min       9.000000
25%      22.300000
50%      23.400000
75%      34.500000
max      54.300000
dtype: float64

In [5]:
data[2]

34.5

In [6]:
raw = [23.4, 54.3, 34.5, 9.0, 22.3]
data = pd.Series(raw, index=['M', 'T', 'W', 'R', 'F'])
data

M    23.4
T    54.3
W    34.5
R     9.0
F    22.3
dtype: float64

In [7]:
data['W']

34.5

In [8]:
data = pd.Series({'Mon':23.4, 'Tue':54.3, 'Wed':34.5, 'Thu':9.0, 'Fri':22.3})
data

Mon    23.4
Tue    54.3
Wed    34.5
Thu     9.0
Fri    22.3
dtype: float64

In [9]:
#mydata = pd.read_csv(filename)

In [10]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90],
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
               'Bob': [83, 65, 85]}
grades_df = pd.DataFrame(grades_dict, index=['T1', 'T2', 'T3'])
grades_df

    Wally  Eva  Sam  Katie  Bob
T1     87  100   94    100   83
T2     96   87   77     81   65
T3     70   90   90     82   85

In [11]:
grades_df.T

        T1  T2  T3
Wally   87  96  70
Eva    100  87  90
Sam     94  77  90
Katie  100  81  82
Bob     83  65  85

In [12]:
grades_df['Wally']
dict(grades_df['Wally'])

{'T1': 87, 'T2': 96, 'T3': 70}

In [13]:
grades_df.Wally

T1    87
T2    96
T3    70
Name: Wally, dtype: int64

In [14]:
grades_df[['Eva', 'Wally']]

    Eva  Wally
T1  100     87
T2   87     96
T3   90     70

In [15]:
grades_df

    Wally  Eva  Sam  Katie  Bob
T1     87  100   94    100   83
T2     96   87   77     81   65
T3     70   90   90     82   85

In [16]:
grades_df.loc['T1'] # extract series with row values as new column
grades_df.iloc[0] # same but with numeric index to extract row

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: T1, dtype: int64

In [17]:
grades_df.loc[['T2', 'T3']][['Wally', 'Sam', 'Bob']]

    Wally  Sam  Bob
T2     96   77   65
T3     70   90   85

In [18]:
grades_df

    Wally  Eva  Sam  Katie  Bob
T1     87  100   94    100   83
T2     96   87   77     81   65
T3     70   90   90     82   85

In [19]:
grades_df.mean()

Wally    84.333333
Eva      92.333333
Sam      87.000000
Katie    87.666667
Bob      77.666667
dtype: float64

In [20]:
grades_df.mean(axis=0) # column-specific mean
grades_df.mean(axis=1) # row-specific mean

T1    92.8
T2    81.2
T3    83.4
dtype: float64

In [21]:
grades_df['Avg'] = grades_df.mean(axis=1)
grades_df

    Wally  Eva  Sam  Katie  Bob   Avg
T1     87  100   94    100   83  92.8
T2     96   87   77     81   65  81.2
T3     70   90   90     82   85  83.4

In [22]:
grades_df['SK_Avg'] = (grades_df.Sam + grades_df.Katie) / 2  # vectorization
grades_df

    Wally  Eva  Sam  Katie  Bob   Avg  SK_Avg
T1     87  100   94    100   83  92.8    97.0
T2     96   87   77     81   65  81.2    79.0
T3     70   90   90     82   85  83.4    86.0

In [23]:
grades2 = grades_df.T
grades2

           T1    T2    T3
Wally    87.0  96.0  70.0
Eva     100.0  87.0  90.0
Sam      94.0  77.0  90.0
Katie   100.0  81.0  82.0
Bob      83.0  65.0  85.0
Avg      92.8  81.2  83.4
SK_Avg   97.0  79.0  86.0

In [24]:
#grades2.append({'T1':50, 'T2':60, "T3":70}) # how to add new rows to df while maintaining original indices

In [25]:
grades2[(grades2.T2 >= 80.0) & (grades2.T3 >= 80.0)] # use '|' (straight line) for OR operator

          T1    T2    T3
Eva    100.0  87.0  90.0
Katie  100.0  81.0  82.0
Avg     92.8  81.2  83.4